

       IDENTIFICATION DIVISION.
       PROGRAM-ID. check.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STOCK-FILE ASSIGN TO "..\STOCK.txt"
               ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD STOCK-FILE.
       01 STOCK-RECORD.
           05 COMPANY-NAME PIC A(25).
           05 PRICE PIC 99V9.

       WORKING-STORAGE SECTION.
       01 MY-FIELDS.
           05 EOF-FLAG PIC X VALUE 'N'.
       01 I-PRICE PIC 99.9.
       01 O-PRICE PIC 99.9.
       01 I-PROMPT PIC X.
       PROCEDURE DIVISION.
       100-PRODUCE-STOCK-REPORT.
            PERFORM 101-INITIALIZE-ROUTINE.
            PERFORM 102-ACCEPT-STOCK-RECORD UNTIL EOF-FLAG = 'Y'.
            PERFORM 103-CLOSE-ROUTINE.
            PERFORM 201-INITIALIZE-ROUTINE.
            PERFORM 202-DISPLAY-STOCK-RECORD UNTIL EOF-FLAG = 'Y'.
            PERFORM 203-CLOSE-ROUTINE.
            STOP RUN.

       101-INITIALIZE-ROUTINE.
           OPEN OUTPUT STOCK-FILE.
           MOVE 'N' TO EOF-FLAG.
       102-ACCEPT-STOCK-RECORD.
           DISPLAY "NAME:".
           ACCEPT COMPANY-NAME.
           DISPLAY "PRICE"
           ACCEPT I-PRICE.
           MOVE I-PRICE TO PRICE.
           DISPLAY STOCK-RECORD.
           WRITE STOCK-RECORD.
           DISPLAY "CONTINUE(Y/N)?".
           ACCEPT I-PROMPT.
           IF I-PROMPT = 'N' MOVE 'Y' TO EOF-FLAG.
        103-CLOSE-ROUTINE.
            CLOSE STOCK-FILE.
       201-INITIALIZE-ROUTINE.
           PERFORM 301-OPEN-STOCK-FILE.
           PERFORM 305-READ-STOCK-RECORD.

       202-DISPLAY-STOCK-RECORD.
               PERFORM 302-DISPLAY-STOCK-RECORD.
               PERFORM 305-READ-STOCK-RECORD.


       203-CLOSE-ROUTINE.
           CLOSE STOCK-FILE.

       301-OPEN-STOCK-FILE.
           OPEN INPUT STOCK-FILE.
           MOVE 'N' TO EOF-FLAG.

       302-DISPLAY-STOCK-RECORD.
           DISPLAY "O-NAME: " COMPANY-NAME
           MOVE PRICE TO O-PRICE
           DISPLAY "O-PRICE: " O-PRICE.

       305-READ-STOCK-RECORD.
           READ STOCK-FILE AT END MOVE 'Y' TO EOF-FLAG.
           DISPLAY STOCK-RECORD.

       END PROGRAM check.
