      ******************************************************************
      * Author:WENJUAN QI
      * Student ID: 041153214
      * Course Section: CST8283 <030>
      * Date: 11 February 2025
      * Purpose: Sample solution to project 1 to show information of employees
      *          who served the organization over 10.5 years.
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT EMPLOYEE-FILE ASSIGN TO "../EMPLOYEES.TXT"
               ORGANISATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD EMPLOYEE-FILE.

       01 EMPLOYEE-RECORD.
           05 EMPLOYEE-ID PIC 9(6).
           05 DEPT-CODE PIC 9(3).
           05 FIRST-NAME PIC A(20).
           05 LAST-NAME PIC A(20).
           05 YEAR-OF-SVC PIC 9(2)V9.

       WORKING-STORAGE SECTION.
       01 CONTROL-FIELDS.
           05 EOF-FLAG PIC A VALUE 'N'.
           05 NEW-RECORD PIC A VALUE 'Y'.

       01 HEADER-INFO.
           05 FILLER PIC X(15) VALUE "EMPLOYEE ID".
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(5) VALUE "DEPT".
           05 FILLER PIC X(3) VALUE SPACES.
           05 FILLER PIC X(15) VALUE "FIRST NAME".
           05 FILLER PIC X(13) VALUE SPACES.
           05 FILLER PIC X(15) VALUE "LAST NAME".
           05 FILLER PIC X(13) VALUE SPACES.
           05 FILLER PIC X(15) VALUE "SERVICE YEAR".

       01 HEADER-DIVISION.
           05 HEADER-LINE PIC X(85) VALUE ALL "=".

       01 EMPLOYEE-OUTPUT-RECORD.
           05 EMPLOYEE-ID-OUT PIC 9(6).
           05 FILLER PIC X(10) VALUE SPACES.
           05 DEPT-CODE-OUT PIC 9(3).
           05 FILLER PIC X(5) VALUE SPACES.
           05 FIRST-NAME-OUT PIC A(20).
           05 FILLER PIC X(13) VALUE SPACES.
           05 LAST-NAME-OUT PIC A(20).
           05 FILLER PIC X(13) VALUE SPACES.
           05 YEAR-OF-SVC-OUT PIC 99.99.

       PROCEDURE DIVISION.
       100-PRODUCE-EMPLOYEE-RECORDS.
           PERFORM 201-INITIALIZE.
           PERFORM 202-CREATE-EMPLOYEE-RECORD UNTIL NEW-RECORD="N".
           PERFORM 203-RESET-EMPLOYEE-FILE.
           PERFORM 204-DISPLAY-EMPLOYEE-RECORD UNTIL EOF-FLAG="Y".
           PERFORM 310-CLOSE-FILE.
            STOP RUN.

       201-INITIALIZE.
           PERFORM 301-OPEN-OUTPUT-FILE.
           PERFORM 302-PROMPT-NEW-RECORD.

       202-CREATE-EMPLOYEE-RECORD.
           PERFORM 303-PROMPT-EMPLOYEE-DATA.
           PERFORM 304-WRITE-RECORD-TO-FILE.
           PERFORM 302-PROMPT-NEW-RECORD.

       203-RESET-EMPLOYEE-FILE.
           PERFORM 310-CLOSE-FILE.
           PERFORM 305-OPEN-INPUT-FILE.
           PERFORM 308-DISPLAY-READER.
           PERFORM 306-READ-EMPLOYEE-FILE.

       204-DISPLAY-EMPLOYEE-RECORD.
           PERFORM 307-DISPLAY-EMPLOYEE-INFO.
           PERFORM 306-READ-EMPLOYEE-FILE.

       205-TERMINATE.
           PERFORM 309-DISPLAY-FOOTER.
           PERFORM 310-CLOSE-FILE.

       301-OPEN-OUTPUT-FILE.
           OPEN OUTPUT EMPLOYEE-FILE.

       302-PROMPT-NEW-RECORD.
           DISPLAY "DO YOU WANT TO ENTER A NEW RECORD (Y/N)"
           ACCEPT NEW-RECORD.

       303-PROMPT-EMPLOYEE-DATA.
           DISPLAY "ENTER A EMPLOYEE-ID(I.E.123456): ".
           ACCEPT EMPLOYEE-ID.
           DISPLAY "ENTER EMPLOYEE'S DEPARTMENT NUMBER".
           ACCEPT DEPT-CODE.
           DISPLAY "ENTER EMPLOYEE FIRST NAME: ".
           ACCEPT FIRST-NAME.
           DISPLAY "ENTER EMPLOYEE LAST NAME: ".
           ACCEPT LAST-NAME.
           DISPLAY "ENTER EMPLOYEE'S YEAR OF SERVICE: ".
           ACCEPT YEAR-OF-SVC.

       304-WRITE-RECORD-TO-FILE.
           WRITE EMPLOYEE-RECORD.

       305-OPEN-INPUT-FILE.
       OPEN INPUT EMPLOYEE-FILE.

       306-READ-EMPLOYEE-FILE.
           READ EMPLOYEE-FILE AT END MOVE "Y" TO EOF-FLAG.
      *>      NOT AT END
               MOVE EMPLOYEE-ID TO EMPLOYEE-ID-OUT
               MOVE DEPT-CODE TO DEPT-CODE-OUT
               MOVE FIRST-NAME TO FIRST-NAME-OUT
               MOVE LAST-NAME TO LAST-NAME-OUT
               MOVE YEAR-OF-SVC TO YEAR-OF-SVC-OUT.

       307-DISPLAY-EMPLOYEE-INFO.
           IF YEAR-OF-SVC >= 10.5 DISPLAY EMPLOYEE-OUTPUT-RECORD
               END-IF.

       308-DISPLAY-READER.
           DISPLAY HEADER-INFO.
           DISPLAY HEADER-LINE.

       309-DISPLAY-FOOTER.
           DISPLAY HEADER-LINE.

       310-CLOSE-FILE.
           CLOSE EMPLOYEE-FILE.


       END PROGRAM PROJECT1.
